Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །རིགས་ཀྱི་བུ་དེས་ཀྱང་སྔོན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ད་ལྟར་ཁྱོད་ཚོལ་བ་བཞིན་དུ་བཙལ་ཏོ།
en: Noble son, he has, in the past, also searched for the perfection of wisdom, just as you are now searching for it.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཉིན་མཚན་དུ་ངལ་བསོ་བའི་ཡིད་ལ་བྱེད་པ་མ་སྐྱེད་པར་སོང་ཤིག་དང་།
en: Noble son, go forth, day and night, paying no attention to [the need for] respite!

source: རིང་པོ་མི་ཐོགས་པར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཐོས་པར་འགྱུར་རོ།
en: Before long you shall hear the perfection of wisdom!’ “

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་དེ་བཞིན་གཤེགས་པའི་བཀའ་འདི་ཐོས་ནས། དགའ་མགུ་ཡི་རངས་རབ་ཏུ་དགའ།
en: Then, when the bodhisattva great being Sadāprarudita had heard this teaching of the Tathāgata, he became elated, joyful, resolute, and contented.

source: མོས་ཤིང་ཡིད་བདེ་བར་གྱུར་པ་ནི་འདི་ལྟ་སྟེ་དཔེར་ན། མི་ཞིག་དུག་དང་བཅས་པའི་ཟུག་རྔུས་ཟུག་ན། ནམ་ཞིག་བདག་གིས་ཟུག་རྔུ་འབྱིན་པའི་སྨན་པ་གང་། བདག་གི་ཟུག་རྔུ་འདི་འབྱིན་ཅིང་། གང་བདག་སྡུག་བསྔལ་འདི་ལས་ཐར་བར་བྱེད་པ་ན་མ་རྙེད་པར་འགྱུར་སྙམ་པ་ལས་གཞན་པའི་ཡིད་ལ་བྱེད་པ་མི་སྐྱེད་པ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ཡང་།
en: Just as a man, hit with a poisoned arrow, does not pay attention to anything but the thought, ‘Where shall I find a doctor who can extract this arrow, one who will extract this arrow and release me from this suffering?’

source: གང་བདག་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོན་ཅིང་ཆོས་གང་བདག་གིས་ཐོས་ནས། དམིགས་པ་དང་བཅས་པའི་ཡིད་ལ་བྱེད་པ་སྤོངས་པར་འགྱུར་བའི་རིགས་ཀྱི་བུ་དེ་ནམ་མཐོང་བར་འགྱུར་སྙམ་པ་ལས་གཞན་པའི་ཆོས་ཅུང་ཟད་ཀྱང་ཡིད་ལ་མི་བྱེད་དོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ས་ཕྱོགས་དེ་ཉིད་དུ་འདུག་སྟེ། ཆོས་ཐམས་ཅད་ལ་མི་གནས་པའི་འདུ་ཤེས་སྐྱེས་པར་གྱུར་ཏོ། །དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་རྒྱུ་དང་། ཚེ་རབས་སྔ་མ་ལ་གོམས་པས་ཏིང་ངེ་འཛིན་གྱི་སྒོ་དུ་མ་མངོན་དུ་གྱུར་པ་ནི་འདི་ལྟ་སྟེ་ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་རྣམ་པར་ལྟ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་མི་དམིགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ལ་ཡེ་ཤེས་འབྱུང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ལ་ཐ་དད་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: in the same way, the bodhisattva great being Sadāprarudita did not pay the slightest attention to anything but the thought, ‘When shall I see that noble son who will teach me the perfection of wisdom, so that, having listened to that Dharma, I shall abandon mental engagement that involves apprehending!’ “

source: ཆོས་ཐམས་ཅད་མི་འགྱུར་བར་མཐོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་སྣང་བར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་མུན་པ་དང་བྲལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་མི་ཤེས་པ་འཇིག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་མི་དམིགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། མེ་ཏོག་མངོན་པར་འཐོར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ཀྱི་བདག་ཉིད་མངོན་པར་སྒྲུབ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སྒྱུ་མ་རྣམ་པར་སྤངས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། མེ་ལོང་གི་དཀྱིལ་འཁོར་ལྟར་རབ་ཏུ་སྣང་བ་མངོན་པར་སྒྲུབ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲ་འབྱིན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སེམས་ཅན་ཐམས་ཅད་མངོན་པར་དགའ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: Then, while he remained in that very place, there arose in the bodhisattva great being Sadāprarudita the perception that did not settle on anything at all.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲ་ལ་མཁས་པའི་རྗེས་སུ་འགྲོ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སྒྲ་དང་ཚིག་དང་འབྲུ་སྣ་ཚོགས་མངོན་པར་འབྱིན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། མ་མནན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རང་བཞིན་གྱིས་ཐ་སྙད་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སྒྲིབ་པ་མེད་པའི་རྣམ་པར་ཐར་པ་ཐོབ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་།
en: On the basis of the perfection of wisdom and through the experience of his former lives, there then manifested many gateways of meditative stability.

source: རྡུལ་དང་བྲལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། མིང་དང་ངེས་པའི་སྒྲ་དང་ཚིག་དང་འབྲུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་རྣམ་པར་མི་མཐོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ངེས་པའི་སྒྲ་དང་ཚིག་དང་འབྲུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་མི་སྒྲིབ་པའི་མཐའ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ནམ་མཁའ་ལྟ་བུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་
en: These included (1) the meditative stability named viewing the essential nature of all phenomena; (2) the meditative stability named nonapprehension of the essential nature of all phenomena; (3) the meditative stability named emergence of wisdom with respect to all phenomena; (4) the meditative stability named nondifferentiation with respect to all phenomena; (5) the meditative stability named observation that all phenomena are unchanging; (6) the meditative stability named illuminator of all phenomena; (7) the meditative stability named separating all phenomena from darkness; (8) the meditative stability named destruction of ignorance with respect to all phenomena; (9) the meditative stability named nonapprehension of all phenomena; (10) the meditative stability named scattering of flowers; (11) the meditative stability named actualizing the embodiment of all phenomena; (12) the meditative stability named abandonment of magical display; (13) the meditative stability named actualizing images on the surface of a mirror; (14) the meditative stability named calling forth the voices of all beings; (15) the meditative stability named gladdening of all beings; (16) the meditative stability named following those learned in the languages of all beings; (17) the meditative stability named calling forth the variety of sounds, words, and syllables; (18) the meditative stability named unoppressed; (19) the meditative stability named naturally devoid of conventional expression; (20) the meditative stability named attainment of unobscured liberation; (21) the meditative stability named immaculate; (22) the meditative stability named nouns, lexical explanations, words, and syllables; (23) the meditative stability named nonperception of all phenomena; (24) the meditative stability named lexical explanations, words, and syllables with respect to all phenomena; (25) the meditative stability named unobscured limit of all phenomena; (26) the meditative stability named space-like; (27) the meditative stability named vajra-like; (28) the meditative stability named approaching the king of physical forms; (29) the meditative stability named attainment of triumph; (30) the meditative stability named irreversible eyes; (31) the meditative stability named emerging from the realm of phenomena; (32) the meditative stability named inspiration; (33) the meditative stability named roaring of the lion; {Va.243} (34) the meditative stability named overwhelming of all beings; (35) the meditative stability named stainless; (36) the meditative stability named absence of afflicted mental states; (37) the meditative stability named lotus ornament; (38) the meditative stability named severance of doubt; (39) the meditative stability named pursuing of all essentials; (40) the meditative stability named sublimation of all phenomena; (41) the meditative stability named attainment of the extrasensory powers, the powers, and the fearlessnesses; (42) the meditative stability named certain realization of all phenomena; (43) the meditative stability named ocean embracing all phenomena; (44) the meditative stability named abandonment of all indolence; (45) the meditative stability named illuminator of the profound doctrine; (46) the meditative stability named resembling Mount Sumeru; (47) the meditative stability named uncaptivated; (48) the meditative stability named destroyer of the entourage of Māra; (49) the meditative stability named nonfixation on the three realms; (50) the meditative stability named emergence of light rays; and (51) the meditative stability named sight of the tathāgatas. “

source: དང་། རྡོ་རྗེ་ལྟ་བུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གཟུགས་ཀྱི་རྒྱལ་པོ་ཉེ་བར་གྱུར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྒྱལ་བ་ཐོབ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཕྱིར་མི་ལྡོག་པའི་མིག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཀྱི་དབྱིངས་ལས་བྱུང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དབུགས་འབྱིན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སེང་གེའི་སྒྲ་སྒྲོགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སེམས་ཅན་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྡུལ་དང་རྣམ་པར་བྲལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། པད་མོའི་རྒྱན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཐེ་ཚོམ་གཅོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སྙིང་པོ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། མངོན་པར་ཤེས་པ་དང་། སྟོབས་དང་། མི་འཇིགས་པ་ཐོབ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ངེས་པར་རྟོགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ཀྱི་འབྱོར་བ་རྒྱ་མཚོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ལེ་ལོ་ཐམས་ཅད་སྤངས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཟབ་མོའི་འོད་བྱེད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རི་རབ་ལྟ་བུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། མི་འཕྲོགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། བདུད་ཀྱི་འཁོར་འཇིག་པར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཁམས་གསུམ་ལ་མངོན་པར་མ་ཞེན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། འོད་ཟེར་འབྱུང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དེ་བཞིན་གཤེགས་པ་མཐོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏེ། དེ་ཏིང་ངེ་འཛིན་དེ་དག་ལ་གནས་པར་གྱུར་ནས། ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཚད་མེད་གྲངས་མེད་པ་རྣམས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ཉིད་རབ་ཏུ་སྟོན་པ་རྣམས་མཐོང་ངོ་།
en: Abiding in these meditative stabilities, he saw immeasurable and countless lord buddhas in the world systems of the ten directions, demonstrating this very perfection of wisdom to bodhisattva great beings.

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་ཀྱང་། དེ་ལ་ལེགས་པ་སྦྱིན་ཞིང་དབུགས་ཕྱུང་ནས་འདི་སྐད་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་ངེད་ཀྱིས་ཀྱང་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཙལ་ཏེ།
en: Those tathāgatas also applauded and inspired him, saying, ‘Noble son, we, too, in the past when we were engaged in the conduct of a bodhisattva, searched for the perfection of wisdom.

source: ཏིང་ངེ་འཛིན་འདི་དག་རབ་ཏུ་ཐོབ་པ་ནི་གང་དེ་ལྟར་ཁྱོད་ཀྱིས་ཐོབ་པའོ།
en: We attained these meditative stabilities that you have now attained.

source: །ཏིང་ངེ་འཛིན་དེ་དག་རབ་ཏུ་ཐོབ་ནས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྟོགས་པར་གྱུར་ཏོ། །ཕྱིར་མི་ལྡོག་པའི་ཆོས་ལ་རབ་ཏུ་གནས་པར་གྱུར་ཏེ།
en: And having attained those meditative stabilities, we indeed realized the perfection of wisdom and became established in the dharmas from which there is no regression.

source: ངེད་ཀྱིས་ཏིང་ངེ་འཛིན་འདི་དག་གི་རང་བཞིན་དང་ངོ་བོ་ཉིད་ལ་བལྟས་ན། སྙོམས་པར་འཇུག་པ་འམ། ལྡང་བ་འམ། གང་བྱང་ཆུབ་ཏུ་སྤྱོད་པ་འམ། གང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བའི་ཆོས་དེ་ལྟ་བུ་གང་ཡང་མ་མཐོང་ངོ་།
en: When we behold the inherent existence and essential nature of these meditative stabilities, we do not see anything at all that becomes absorbed in them, that arises from them, that would practice for awakening , or that would attain consummate buddhahood in unsurpassed, complete enlightenment. “ ‘

source: །རིགས་ཀྱི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་ཆོས་གང་ལ་ཡང་སེམས་པ་མེད་དོ།
en: Noble son, this perfection of wisdom is without conceits about anything at all.

source: །རིགས་ཀྱི་བུ་ངེད་ཀྱིས་སེམས་པ་མེད་པ་ལ་གནས་པས། ལུས་གསེར་གྱི་ཁ་དོག་ལྟ་བུ་འདི་ལྟ་བུ་དག་རབ་ཏུ་ཐོབ། སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་དང་། འོད་འདོམ་གང་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་བསམ་གྱིས་མི་ཁྱབ་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་དང་།
en: Noble son, because we are established in the absence of conceits, our bodies have acquired a color resembling that of gold.

source: སངས་རྒྱས་ཀྱི་ཤེས་རབ་དང་། བླ་ན་མེད་པའི་ཏིང་ངེ་འཛིན་རྣམས་དང་། ཡོན་ཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱིས་ཀྱང་ཚད་བཟུང་བ་འམ། མཐའ་བསྟན་པར་མི་ནུས་ན། ཉན་ཐོས་དང་།
en: Not to mention the śrāvakas and pratyekabuddhas, even the tathāgatas, arhats, completely awakened buddhas cannot grasp the measure of, or disclose the limits of, the thirty-two major marks of a great person, the eighty excellent minor marks, the aureole of light extending a full arm span, the inconceivable attributes of the buddhas, the gnosis of the buddhas, the wisdom of the buddhas, the unsurpassed meditative stabilities, or the perfection of enlightened attributes.

source: རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ལྟ་སྨོས་ཀྱང་མི་དགོས་པ་དེ་ལྟ་བུའི་ཡོན་ཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དག་རབ་ཏུ་ཐོབ་བོ། །དེ་བས་ན་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཀྱང་ཆོས་འདི་དག་ཉིད་ལ་གུས་པ་རབ་ཏུ་བསྐྱེད་པར་བྱའོ།
en: Therefore, noble son, you should indeed cultivate respect for these attributes.

source: །ལྷག་པར་དོན་དུ་གཉེར་བ་དང་། མོས་པར་བྱ་བ་བསྐྱེད་པར་བྱའོ།
en: You should cultivate an increasing interest and belief in them.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རིགས་ཀྱི་བུ་དོན་དུ་གཉེར་བ་དང་། མོས་པར་བྱེད་པ་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མི་དཀོན་ནོ།
en: If you ask why, noble son, unsurpassed, complete enlightenment is not a rarity for those who are interested in it and who believe in it.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དགེ་བའི་བཤེས་གཉེན་ལ་ཡང་གུས་པ་རབ་ཏུ་སྐྱེད་ཅིང་དགའ་བར་བྱའོ།
en: Noble son, you should also cultivate respect and empathy for spiritual mentors.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་ཟིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱའོ།
en: If you ask why, bodhisattva great beings who have been accepted by spiritual mentors will attain consummate buddhahood in unsurpassed, complete enlightenment.’ “

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བདག་གི་དགེ་བའི་བཤེས་གཉེན་གང་ལགས།
en: Then the bodhisattva great being Sadāprarudita asked those tathāgatas, ‘Who is my spiritual mentor?’ “

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་ལ་འདི་སྐད་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་ཁྱོད་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པས་ཡུན་རིང་པོ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་ཡོངས་སུ་བཟུང་།
en: Those tathāgatas replied to the bodhisattva great being Sadāprarudita, ‘Noble son, the bodhisattva great being Dharmodgata has over a long period of time brought you to maturity in unsurpassed, complete enlightenment, and favored you with the perfection of wisdom.

source: ཐབས་མཁས་པ་ལ་ཡང་བསླབས་ཏེ།
en: He has also trained you in skill in means.

source: དེ་ནི་རིགས་ཀྱི་བུ་ཁྱོད་ལ་ཕན་འདོགས་པ་ཡིན།
en: It is he, noble son, who has benefited you.

source: དགེ་བའི་བཤེས་གཉེན་ཡིན་ནོ།
en: He is your spiritual mentor.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེའི་བྱས་པ་གཟུངས་སུ་བཟུང་ངོ་། །གལ་ཏེ་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་དེ། བསྐལ་པ་གཅིག་གམ། བསྐལ་པ་གཉིས་སམ། བསྐལ་པ་བརྒྱ་འམ། བསྐལ་པ་སྟོང་ངམ།
en: Noble son, you should keep in mind the deeds he has undertaken on your behalf.

source: དེ་བས་ཀྱང་ལྷག་པར་རས་ཀྱི་ཐོད་བཞིན་དུ་མགོ་ལ་ཁྱེར་རམ། བདེ་བའི་ཡོ་བྱད་ཐམས་ཅད་བྱིན་ནམ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། གཟུགས་དང་། སྒྲ་དང་དྲི་དང་རོ་དང་རེག་པ་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་བྱིན་ཡང་དེ་ཙམ་གྱིས་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་ལ་ལན་ལོན་པར་མི་འགྱུར་རོ།
en: If, noble son, {Va.244} you were to carry the bodhisattva great being Dharmodgata on your head like a turban for one eon, two eons, a hundred eons, a thousand eons, or even longer, and furnish him with the resources that bring happiness, or grant to him all those sights, sounds, smells, tastes, and tangibles, as many as there are in the world systems of the great trichiliocosm, even by that, noble son, you would not repay him.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རིགས་ཀྱི་བུ་དེའི་མཐུས་ཁྱོད་འདི་ལྟ་བུའི་ཏིང་ངེ་འཛིན་རྣམས་ཐོབ་པར་གྱུར། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་མཁས་པ་ཐོས་པར་གྱུར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རབ་ཏུ་ཐོབ་པར་འགྱུར་བའི་ཕྱིར་རོ།
en: If you ask why, noble son, it is through his power that you have acquired such meditative stabilities, that you have listened to those skilled in the perfection of wisdom, and that you will attain the perfection of wisdom.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། བྱང་ཆུབ་སེམས་དཔའ་རྟག་པར་རབ་ཏུ་ངུ་བས། ཏིང་ངེ་འཛིན་གྱི་སྒོ་མང་པོ་ཐོབ་པའི་ལེའུ་སྟེ། བདུན་ཅུ་རྩ་གསུམ་པའོ།། །།
en: This completes the seventy-third chapter, “The Bodhisattva Sadāprarudita’s Attainment of the Manifold Gateways of Meditative Stability,” from The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་ཡང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་དབུགས་ཕྱུང་ནས་མི་སྣང་བར་གྱུར་ཏོ།
en: Chapter 74: Sadāprarudita “Then, having inspired the bodhisattva great being Sadāprarudita, those tathāgatas, arhats, completely awakened buddhas again disappeared.

source: །རིགས་ཀྱི་བུ་དེ་ཡང་ཏིང་ངེ་འཛིན་དེ་རྣམས་ལས་ལངས་པར་གྱུར་ཏོ། །ལངས་ནས་ཀྱང་དེ་འདི་སྙམ་དུ་དེ་བཞིན་གཤེགས་པ་འདི་དག་ག་ནས་བྱོན།
en: On arising from those meditative stabilities, [Sadāprarudita], the noble son, then thought, ‘From where did these tathāgatas come?

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གང་དུ་བཞུད་སྙམ་སེམས་པར་གྱུར་ཏོ།
en: Where have these tathāgatas gone?’

source: །དེས་དེ་བཞིན་གཤེགས་པ་དེ་དག་མ་མཐོང་བ་དང་། མི་དགའ་ཞིང་གདུང་བ་ཆེན་པོར་གྱུར་ཏེ་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏོ།
en: He no longer saw those tathāgatas, and he became depressed and tormented.

source: །འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་དེ་གཟུངས་རབ་ཏུ་ཐོབ་ལ།
en: He had the thought, ‘That sublime bodhisattva great being Dharmodgata has acquired the dhāraṇīs.

source: ལྔ་མངོན་པར་ཤེས་པ་སྔོན་གྱི་རྒྱལ་བ་ལ་བྱ་བ་བྱས་པ་སྟེ།
en: He has mastered the five extrasensory powers and has performed his duties with respect to the conquerors of the past.

source: བདག་ལ་ཕན་འདོགས་པ། བདག་གི་དགེ་བའི་བཤེས་གཉེན་ཏེ།
en: He has benefited me and he is my spiritual mentor.

source: ཡུན་རིང་པོར་དེས་བདག་གི་དོན་བྱས་པས།
en: For a long period of time he has acted on my behalf.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གང་ནས་བྱོན། དེ་བཞིན་གཤེགས་པ་དེ་དག་གར་བཞུད་ཅེས་བྱ་བའི་དོན་དེ་བདག་གིས་འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་དེའི་དྲུང་དུ་ཉེ་བར་སོང་སྟེ། དྲི་བར་བྱའོ་སྙམ་དུ་སེམས་པར་གྱུར་ཏོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ།
en: I should approach the sublime bodhisattva great being Dharmodgata and ask him about this matter! From where did those tathāgatas come, and to where did they go?’ “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་དེ་ལ་དགའ་བ་དང་། དང་བ་དང་། རྗེ་ས་དང་། གུས་པ་བསྐྱེད་ནས་སྔར་འདི་སྙམ་དུ་བསམས་སོ། །བདག་གིས་སྟི་སྟང་ཇི་ལྟ་བུ་ཞིག་གིས་འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་བསྙེན་པར་བྱ།
en: Then the bodhisattva great being Sadāprarudita cultivated enthusiasm, confidence, reverence, and respect for that bodhisattva great being Dharmodgata, and before long he had the following thought: ‘With what kind of honor should I venerate the sublime bodhisattva great being Dharmodgata?

source: བདག་ཀྱང་དབུལ་བས་བདག་ལ་གོས་སམ། རིན་པོ་ཆེ་འམ། གསེར་རམ། མུ་ཏིག་གམ། བཻ་ཌཱུརྱ་འམ། དུང་ངམ། ཤེལ་ལམ། བྱུ་རུ་འམ། དངུལ་ལམ། མེ་ཏོག་གམ། བདུག་པ་འམ།
en: Since I am poor, I have nothing at all worthy of presenting in honor of that sublime bodhisattva great being Dharmodgata, whether clothing, gemstones, gold, pearls, beryl, conch, crystal, coral, silver, flowers, incense, perfume, garlands, unguents, or parasols.

source: སྤོས་སམ། ཕྲེང་བ་དང་། བྱུག་པ་འམ། གདུགས་གང་གིས་འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་དེ་ལ་སྟི་སྟང་དུ་བྱ་བར་འོས་པ་དེ་ལྟ་བུ་ཅུང་ཟད་ཀྱང་མེད། བདག་དེ་བཞིན་དུ་འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་དེའི་དྲུང་དུ་འགྲོ་བར་ཡང་མི་རིགས་ལ།
en: It would not be right for me to approach that sublime bodhisattva great being Dharmodgata in this manner.

source: བདག་དགའ་ཞིང་མགུ་བར་ཡང་མི་འགྱུར་རོ་སྙམ་ནས།
en: I am downcast and saddened.’ “

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་དེ་ལྟ་བུར་བླ་མ་ལ་གུས་ཤིང་རིམ་གྲོ་བྱ་བའི་དོན་ཡིད་ལ་བྱེད་པས།
en: Then the bodhisattva great being Sadāprarudita finally continued on his way, focusing his attention on his purpose—to respect and venerate such a spiritual teacher.

source: མཐར་གྱིས་སོང་སོང་ན། གྲོང་ཁྱེར་གཅིག་ཅིག་ཏུ་ཕྱིན་ཏེ། དེར་ཚོང་དུས་ཀྱི་དབུས་སུ་ཕྱིན་པ་དང་། འདི་སྙམ་དུ་བསམས་སོ། །བདག་གི་ལུས་འདི་བཙོངས་ཏེ།
en: In due course he reached a city, went into the middle of the marketplace, and thought, ‘I should sell this body of mine!

source: དེའི་རིན་གྱིས་འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་མཆོད་པ་བྱའོ།
en: With its price I will worship the sublime bodhisattva great being Dharmodgata! “ ‘

source: །ཡུན་རིང་མོ་ཞིག་ཏུ་བདག་གི་ལུས་སྟོང་ཙམ་ཞིག་པར་གྱུར། དེངས་པར་གྱུར། བཙོངས་རྨེག་མེད་པར་གྱུར་ཏེ་དཔག་ཏུ་མེད་པའི་འཁོར་བར་ཡང་དང་ཡང་དུ་འཁོར་བ་ན།
en: Over a long period of time almost a thousand bodies of mine have perished and rotted, been sold, and been eradicated.

source: དཔག་ཏུ་མེད་པའི་སེམས་ཅན་དམྱལ་བ་དང་། བྱོལ་སོང་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་སྡུག་བསྔལ་མྱོང་བར་གྱུར་ཏེ། དེ་ཡང་འདོད་པའི་རྒྱུ་དང་འདོད་པའི་གཞིའི་ཕྱིར་གྱི། ཆོས་འདི་ལྟ་བུའི་ཕྱིར་རམ། བྱང་ཆུབ་སེམས་དཔའ་འདི་ལྟ་བུ་དག་ལ་མཆོད་པའི་ཕྱིར་ནི་མ་ཡིན་ནོ།
en: Roaming again and again through inestimable cyclic existence, I have experienced inestimable sufferings among the hells, the animals, and the worlds of Yama, due to the primary cause of desire and the basis of desire, but not for the sake of a Dharma of this kind, and not for the sake of worshiping beings such as this bodhisattva.’ “

source: །སྙམ་མོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བས། ཚོང་དུས་ཀྱི་དབུས་སུ་མི་སུ་ཉོ་མི་སུ་ཉོ་ཞེས་བྱ་བའི་སྒྲ་ཕྱུང་སྟེ་བོས་སོ།
en: Then the bodhisattva great being Sadāprarudita went into the middle of the marketplace, raised his voice, and cried out, ‘Who wants to buy a man? Who wants to buy a man?’ “

source: །དེ་ནས་བདུད་སྡིག་ཏོ་ཅན་འདི་སྙམ་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་འདི་ཆོས་འདོད་པའི་ཕྱིར་བདག་ཉིད་བཙོངས་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱིས་འཕགས་པ་ལ་མཆོད་པ་བྱས་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཇི་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མྱུར་དུ་རྫོགས་པར་འགྱུར། ཐོས་པ་རྒྱ་མཚོ་ལྟ་བུ་ཐོབ་པར་འགྱུར། བདུད་དང་བདུད་ཀྱི་རིས་སུ་གཏོགས་པའི་ལྷ་རྣམས་ཀྱིས་མི་ཚུགས་པར་འགྱུར། ཡོན་ཏན་ཐམས་ཅད་ཀྱི་མཐར་ཕྱིན་པར་འགྱུར་ཞེས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཐབས་མཁས་པས་ཡོངས་སུ་འདྲི་བར་འགྱུར་ཏེ།
en: Thereupon the evil Māra thought, ‘I should obstruct this bodhisattva great being Sadāprarudita because, if he sells himself out of desire for the Dharma, and then makes offerings to the bodhisattva great being Dharmodgata, {Va.245} and then, with regard to the perfection of wisdom, asks him with skill in means how bodhisattva great beings practicing the perfection of wisdom may swiftly attain unsurpassed, complete enlightenment, acquire ocean-like erudition, be unharmed by the gods including Māra and the domain of Māra, and conclusively perfect all enlightened attributes, he will work for the benefit of all beings, and they too will bypass my perceptual range.

source: དེས་ཀྱང་སེམས་ཅན་མང་པོའི་དོན་བྱེད་པར་འགྱུར་དེ་དག་ཀྱང་བདག་གི་སྤྱོད་ཡུལ་ལས་འདས་པར་འགྱུར་ལ། སེམས་ཅན་གཞན་དག་ཀྱང་བདག་གིས་སྤྱོད་ཡུལ་ལས་འདས་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བར་འགྱུར་གྱིས། དེའི་ཕྱིར་བདག་གིས་དེའི་བར་ཆད་བྱའོ་སྙམ་དུ་བསམས་སོ།
en: And once other beings, too, have bypassed my perceptual range, he will then attain consummate buddhahood in unsurpassed, complete enlightenment!’ “

source: །དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་བྲམ་ཟེ་དང་། ཁྱིམ་བདག་དེ་རྣམས་ལ་ཅི་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བས་མི་སུ་ཉོ་མི་སུ་ཉོ་ཞེས་བྱ་བའི་སྒྲ་བརྗོད་པ་དེ་མི་ཐོས་པར་འགྱུར་བ་དེ་ལྟ་བུར་ཟིལ་གྱིས་མནན་ཏོ།
en: Then the evil Māra overwhelmed the brahmins and householders so that in no way could they hear the voice of the bodhisattva great being Sadāprarudita saying, ‘Who wants to buy a man? Who wants to buy a man?’

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྟག་པར་རབ་ཏུ་ངུ་བ་བདག་ཉོ་བ་མ་རྙེད་པ་དང་།
en: When the bodhisattva great being Sadāprarudita could not find a buyer for himself, he went to one side and wept, thinking, ‘Alas!

source: ཕྱོགས་གཅིག་ཏུ་སོང་སྟེ་ངུས་ནས་འདི་སྙམ་དུ་ཨེ་མའོ་བདག་གི་ལུས་ཉོ་བ་ཡང་མེད་དེ།
en: There is no buyer at all for my body!

source: རྙེད་པ་རབ་ཏུ་མ་རྙེད་དོ་སྙམ་དུ་སེམས་སོ།
en: I am not going to achieve what I want to acheive!’ “
